{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "InceptionBlock", "config": {"name": "inception_block", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "branch1": 64, "branch2": [96, 128], "branch3": [16, 32], "branch4": [32], "activation": "elu"}}, {"class_name": "InceptionBlock", "config": {"name": "inception_block_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "branch1": 128, "branch2": [128, 192], "branch3": [32, 96], "branch4": [64], "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "InceptionBlock", "config": {"name": "inception_block_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "branch1": 192, "branch2": [96, 208], "branch3": [16, 48], "branch4": [64], "activation": "elu"}}, {"class_name": "InceptionBlock", "config": {"name": "inception_block_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "branch1": 160, "branch2": [112, 224], "branch3": [24, 64], "branch4": [64], "activation": "elu"}}, {"class_name": "InceptionBlock", "config": {"name": "inception_block_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "branch1": 128, "branch2": [128, 256], "branch3": [24, 64], "branch4": [64], "activation": "elu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 28, 28, 1]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "sequential/batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/beta", "shape": [192], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential/conv2d_36/kernel", "shape": [7, 7, 1, 64], "dtype": "float32"}, {"name": "sequential/conv2d_36/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv2d_37/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "sequential/conv2d_37/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv2d_38/kernel", "shape": [3, 3, 64, 192], "dtype": "float32"}, {"name": "sequential/conv2d_38/bias", "shape": [192], "dtype": "float32"}, {"name": "sequential/conv2d_39/kernel", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "sequential/conv2d_39/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [512, 10], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [10], "dtype": "float32"}, {"name": "inception_block/conv2d/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "inception_block/conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "inception_block/conv2d_1/kernel", "shape": [1, 1, 64, 96], "dtype": "float32"}, {"name": "inception_block/conv2d_1/bias", "shape": [96], "dtype": "float32"}, {"name": "inception_block/conv2d_2/kernel", "shape": [3, 3, 96, 128], "dtype": "float32"}, {"name": "inception_block/conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "inception_block/conv2d_3/kernel", "shape": [1, 1, 64, 16], "dtype": "float32"}, {"name": "inception_block/conv2d_3/bias", "shape": [16], "dtype": "float32"}, {"name": "inception_block/conv2d_4/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "inception_block/conv2d_4/bias", "shape": [32], "dtype": "float32"}, {"name": "inception_block/conv2d_5/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "inception_block/conv2d_5/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_6/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_6/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_7/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_7/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_8/kernel", "shape": [3, 3, 128, 192], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_8/bias", "shape": [192], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_9/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_9/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_10/kernel", "shape": [5, 5, 32, 96], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_10/bias", "shape": [96], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_11/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "sequential/inception_block_1/conv2d_11/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_12/kernel", "shape": [1, 1, 480, 192], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_12/bias", "shape": [192], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_13/kernel", "shape": [1, 1, 480, 96], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_13/bias", "shape": [96], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_14/kernel", "shape": [3, 3, 96, 208], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_14/bias", "shape": [208], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_15/kernel", "shape": [1, 1, 480, 16], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_15/bias", "shape": [16], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_16/kernel", "shape": [5, 5, 16, 48], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_16/bias", "shape": [48], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_17/kernel", "shape": [1, 1, 480, 64], "dtype": "float32"}, {"name": "sequential/inception_block_2/conv2d_17/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_18/kernel", "shape": [1, 1, 512, 160], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_18/bias", "shape": [160], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_19/kernel", "shape": [1, 1, 512, 112], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_19/bias", "shape": [112], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_20/kernel", "shape": [3, 3, 112, 224], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_20/bias", "shape": [224], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_21/kernel", "shape": [1, 1, 512, 24], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_21/bias", "shape": [24], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_22/kernel", "shape": [5, 5, 24, 64], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_22/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_23/kernel", "shape": [1, 1, 512, 64], "dtype": "float32"}, {"name": "sequential/inception_block_3/conv2d_23/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_24/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_24/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_25/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_25/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_26/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_26/bias", "shape": [256], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_27/kernel", "shape": [1, 1, 512, 24], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_27/bias", "shape": [24], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_28/kernel", "shape": [5, 5, 24, 64], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_28/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_29/kernel", "shape": [1, 1, 512, 64], "dtype": "float32"}, {"name": "sequential/inception_block_4/conv2d_29/bias", "shape": [64], "dtype": "float32"}]}]}